src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <comment>Поставленные Заказы (по флотам РФ и по Заказчикам)</comment>
  <owners>Catalog.ПроектыКораблей</owners>
  <attributes>
    <name>БортовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Флоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостройки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вооружение</name>
    <attributes>
      <name>Вооружение</name>
      <type>
        <types>CatalogRef.ВооружениеКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Заказы/Forms/ФормаВыбора/Module.bsl
////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ИзменитьСписок(Знач Проекты)

	Список.ПроизвольныйЗапрос = Истина;
	
	Список.ТекстЗапроса = "ВЫБРАТЬ
	|	СправочникЗаказы.Ссылка,
	|	СправочникЗаказы.ПометкаУдаления,
	|	СправочникЗаказы.Владелец,
	|	СправочникЗаказы.Код,
	|	СправочникЗаказы.Наименование,
	|	СправочникЗаказы.БортовойНомер,
	|	СправочникЗаказы.Заказчик,
	|	СправочникЗаказы.ДатаПостройки,
	|	СправочникЗаказы.Строитель,
	|	СправочникЗаказы.ЗаводскойНомер,
	|	СправочникЗаказы.ДополнительнаяИнформация,
	|	СправочникЗаказы.Предопределенный,
	|	СправочникЗаказы.ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.Заказы КАК СправочникЗаказы
	|ГДЕ
	|	СправочникЗаказы.Владелец В(&Проекты)";
	
	Список.Параметры.УстановитьЗначениеПараметра("Проекты", Проекты);	

КонецПроцедуры // ИзменитьСписок()

&НаСервере
Процедура УстановитьОтборПоЗаказчику()
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбора 					= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Заказчик");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Заказчик.ВМС;
	ЭлементОтбора.Использование 	= Истина;
КонецПроцедуры // УстановитьОтборПоЗаказчику

////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
	
		Если ВладелецФормы.ТекущийЭлемент.ПараметрыВыбора.Количество() > 0 Тогда
			
			Для каждого ПараметрВыбора Из ВладелецФормы.ТекущийЭлемент.ПараметрыВыбора Цикл
			
				Если ПараметрВыбора.Имя = "Проекты" Тогда
					
					Если ПараметрВыбора.Значение.Количество() > 0 Тогда
					
						ИзменитьСписок(ПараметрВыбора.Значение);	
					
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;	
	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ 29.06.2018 Веденеев П. //отключение видимости служебного корабля в списке
	ОтборСлужебныйЗаказ = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСлужебныйЗаказ.Использование = Истина;
	ОтборСлужебныйЗаказ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ОтборСлужебныйЗаказ.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборСлужебныйЗаказ.ПравоеЗначение = Константы.СлужебныйЗаказ.Получить();
	//++ 29.06.2018 Веденеев П. //отключение видимости служебного корабля в списке
	
	Параметры.Свойство("Заказчик", Заказчик);
	Если ЗначениеЗаполнено(Заказчик) Тогда
		УстановитьОтборПоЗаказчику();
	КонецЕсли; // Если ЗначениеЗаполнено(Заказчик) Тогда	
КонецПроцедуры
